# CannotCreateRailGeom Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..CannotCreateRailGeom Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Can't create geometry for one or more Rails
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateRailGeom { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateRailGeom As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateRailGeom {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace